#+TITLE: Prow/{pre,post}submit and Netlify/preview+production jobs
#+AUTHOR: Hippie Hacker
#+EMAIL: hh@ii.coop
#+CREATOR: ii.coop
#+DATE: 30th of April, 2019
* Update Scripts to easily understand what triggers them

To combine the two CI system (prow and netlify) we run against PRs and merges / commits to master

We moved/added mode the scripts to hack/ci/CISYSTEM-TYPE.sh ala:

#+BEGIN_EXAMPLE
renamed    update.sh -> hack/ci/netlify-pr.sh
new file   hack/ci/netlify-production.sh
renamed    hack/ci/process-audits.sh -> hack/ci/prow-pr.sh
new file   hack/ci/prow-production.sh netlify.toml
#+END_EXAMPLE

We also needed needed to update the CI systems to reference them.

* prow

In general these jobs seem to take 4 minutes and need 3-4 GB ram.

WHAT IF: there was a way to inspect our own podspec during a run to see how much memory we can allocate?
WHAT IF: we could run all the jobs at once (have an option to parallelize)

** prs
[[file:~/ii/org/cncf/ci/prow.org::*apisnoop-process-audits][apisnoop-process-audits]]

#+BEGIN_SRC shell
  LATEST_JOB=$(gsutil cat gs://apisnoop/pr-logs/directory/apisnoop-process-audits/latest-build.txt)
  echo LATEST_JOB: $LATEST_JOB
  LATEST_BUCKET_PREFIX=$(gsutil cat gs://apisnoop/pr-logs/directory/apisnoop-process-audits/$LATEST_JOB.txt)
  echo LATEST_BUCKET_PREFIX=$LATEST_BUCKET_PREFIX
  gsutil ls -lR $LATEST_BUCKET_PREFIX
#+END_SRC

#+RESULTS:
#+BEGIN_EXAMPLE :noeval t
LATEST_JOB: 1125429329426124800
LATEST_BUCKET_PREFIX=gs://apisnoop/pr-logs/pull/227/apisnoop-process-audits/1125429329426124800
gs://apisnoop/pr-logs/pull/227/apisnoop-process-audits/1125429329426124800/:
     42743  2019-05-06T16:17:00Z  gs://apisnoop/pr-logs/pull/227/apisnoop-process-audits/1125429329426124800/build-log.txt
      1949  2019-05-06T15:58:38Z  gs://apisnoop/pr-logs/pull/227/apisnoop-process-audits/1125429329426124800/clone-log.txt
      2718  2019-05-06T15:58:38Z  gs://apisnoop/pr-logs/pull/227/apisnoop-process-audits/1125429329426124800/clone-records.json
       111  2019-05-06T16:17:00Z  gs://apisnoop/pr-logs/pull/227/apisnoop-process-audits/1125429329426124800/finished.json
       216  2019-05-06T15:58:38Z  gs://apisnoop/pr-logs/pull/227/apisnoop-process-audits/1125429329426124800/started.json

gs://apisnoop/pr-logs/pull/227/apisnoop-process-audits/1125429329426124800/artifacts/:

gs://apisnoop/pr-logs/pull/227/apisnoop-process-audits/1125429329426124800/artifacts/ci-kubernetes-e2e-gce-cos-k8sbeta-default/:

gs://apisnoop/pr-logs/pull/227/apisnoop-process-audits/1125429329426124800/artifacts/ci-kubernetes-e2e-gce-cos-k8sbeta-default/1123720090269782017/:
    302087  2019-05-06T16:17:00Z  gs://apisnoop/pr-logs/pull/227/apisnoop-process-audits/1125429329426124800/artifacts/ci-kubernetes-e2e-gce-cos-k8sbeta-default/1123720090269782017/endpoints.json
       489  2019-05-06T16:17:00Z  gs://apisnoop/pr-logs/pull/227/apisnoop-process-audits/1125429329426124800/artifacts/ci-kubernetes-e2e-gce-cos-k8sbeta-default/1123720090269782017/finished.json
       325  2019-05-06T16:17:00Z  gs://apisnoop/pr-logs/pull/227/apisnoop-process-audits/1125429329426124800/artifacts/ci-kubernetes-e2e-gce-cos-k8sbeta-default/1123720090269782017/metadata.json
   9516611  2019-05-06T16:17:02Z  gs://apisnoop/pr-logs/pull/227/apisnoop-process-audits/1125429329426124800/artifacts/ci-kubernetes-e2e-gce-cos-k8sbeta-default/1123720090269782017/test_sequences.json
    200941  2019-05-06T16:17:00Z  gs://apisnoop/pr-logs/pull/227/apisnoop-process-audits/1125429329426124800/artifacts/ci-kubernetes-e2e-gce-cos-k8sbeta-default/1123720090269782017/test_tags.json
   2530649  2019-05-06T16:17:02Z  gs://apisnoop/pr-logs/pull/227/apisnoop-process-audits/1125429329426124800/artifacts/ci-kubernetes-e2e-gce-cos-k8sbeta-default/1123720090269782017/tests.json
     33061  2019-05-06T16:17:00Z  gs://apisnoop/pr-logs/pull/227/apisnoop-process-audits/1125429329426124800/artifacts/ci-kubernetes-e2e-gce-cos-k8sbeta-default/1123720090269782017/useragents.json

gs://apisnoop/pr-logs/pull/227/apisnoop-process-audits/1125429329426124800/artifacts/ci-kubernetes-e2e-gce-cos-k8sstable1-default/:

gs://apisnoop/pr-logs/pull/227/apisnoop-process-audits/1125429329426124800/artifacts/ci-kubernetes-e2e-gce-cos-k8sstable1-default/1123713042312335360/:
    285713  2019-05-06T16:17:00Z  gs://apisnoop/pr-logs/pull/227/apisnoop-process-audits/1125429329426124800/artifacts/ci-kubernetes-e2e-gce-cos-k8sstable1-default/1123713042312335360/endpoints.json
       493  2019-05-06T16:17:00Z  gs://apisnoop/pr-logs/pull/227/apisnoop-process-audits/1125429329426124800/artifacts/ci-kubernetes-e2e-gce-cos-k8sstable1-default/1123713042312335360/finished.json
       329  2019-05-06T16:17:00Z  gs://apisnoop/pr-logs/pull/227/apisnoop-process-audits/1125429329426124800/artifacts/ci-kubernetes-e2e-gce-cos-k8sstable1-default/1123713042312335360/metadata.json
  14106658  2019-05-06T16:17:03Z  gs://apisnoop/pr-logs/pull/227/apisnoop-process-audits/1125429329426124800/artifacts/ci-kubernetes-e2e-gce-cos-k8sstable1-default/1123713042312335360/test_sequences.json
    182185  2019-05-06T16:17:00Z  gs://apisnoop/pr-logs/pull/227/apisnoop-process-audits/1125429329426124800/artifacts/ci-kubernetes-e2e-gce-cos-k8sstable1-default/1123713042312335360/test_tags.json
   3016622  2019-05-06T16:17:02Z  gs://apisnoop/pr-logs/pull/227/apisnoop-process-audits/1125429329426124800/artifacts/ci-kubernetes-e2e-gce-cos-k8sstable1-default/1123713042312335360/tests.json
     31477  2019-05-06T16:17:00Z  gs://apisnoop/pr-logs/pull/227/apisnoop-process-audits/1125429329426124800/artifacts/ci-kubernetes-e2e-gce-cos-k8sstable1-default/1123713042312335360/useragents.json

gs://apisnoop/pr-logs/pull/227/apisnoop-process-audits/1125429329426124800/artifacts/ci-kubernetes-e2e-gce-cos-k8sstable2-default/:

gs://apisnoop/pr-logs/pull/227/apisnoop-process-audits/1125429329426124800/artifacts/ci-kubernetes-e2e-gce-cos-k8sstable2-default/1123638123377463296/:
    279017  2019-05-06T16:17:00Z  gs://apisnoop/pr-logs/pull/227/apisnoop-process-audits/1125429329426124800/artifacts/ci-kubernetes-e2e-gce-cos-k8sstable2-default/1123638123377463296/endpoints.json
       493  2019-05-06T16:17:00Z  gs://apisnoop/pr-logs/pull/227/apisnoop-process-audits/1125429329426124800/artifacts/ci-kubernetes-e2e-gce-cos-k8sstable2-default/1123638123377463296/finished.json
       329  2019-05-06T16:17:00Z  gs://apisnoop/pr-logs/pull/227/apisnoop-process-audits/1125429329426124800/artifacts/ci-kubernetes-e2e-gce-cos-k8sstable2-default/1123638123377463296/metadata.json
  12371776  2019-05-06T16:17:03Z  gs://apisnoop/pr-logs/pull/227/apisnoop-process-audits/1125429329426124800/artifacts/ci-kubernetes-e2e-gce-cos-k8sstable2-default/1123638123377463296/test_sequences.json
    149436  2019-05-06T16:17:00Z  gs://apisnoop/pr-logs/pull/227/apisnoop-process-audits/1125429329426124800/artifacts/ci-kubernetes-e2e-gce-cos-k8sstable2-default/1123638123377463296/test_tags.json
   2639290  2019-05-06T16:17:02Z  gs://apisnoop/pr-logs/pull/227/apisnoop-process-audits/1125429329426124800/artifacts/ci-kubernetes-e2e-gce-cos-k8sstable2-default/1123638123377463296/tests.json
     30021  2019-05-06T16:17:00Z  gs://apisnoop/pr-logs/pull/227/apisnoop-process-audits/1125429329426124800/artifacts/ci-kubernetes-e2e-gce-cos-k8sstable2-default/1123638123377463296/useragents.json

gs://apisnoop/pr-logs/pull/227/apisnoop-process-audits/1125429329426124800/artifacts/ci-kubernetes-e2e-gce-cos-k8sstable3-default/:

gs://apisnoop/pr-logs/pull/227/apisnoop-process-audits/1125429329426124800/artifacts/ci-kubernetes-e2e-gce-cos-k8sstable3-default/1123621511530287106/:
    323678  2019-05-06T16:17:00Z  gs://apisnoop/pr-logs/pull/227/apisnoop-process-audits/1125429329426124800/artifacts/ci-kubernetes-e2e-gce-cos-k8sstable3-default/1123621511530287106/endpoints.json
       497  2019-05-06T16:17:00Z  gs://apisnoop/pr-logs/pull/227/apisnoop-process-audits/1125429329426124800/artifacts/ci-kubernetes-e2e-gce-cos-k8sstable3-default/1123621511530287106/finished.json
       331  2019-05-06T16:17:00Z  gs://apisnoop/pr-logs/pull/227/apisnoop-process-audits/1125429329426124800/artifacts/ci-kubernetes-e2e-gce-cos-k8sstable3-default/1123621511530287106/metadata.json
         2  2019-05-06T16:17:00Z  gs://apisnoop/pr-logs/pull/227/apisnoop-process-audits/1125429329426124800/artifacts/ci-kubernetes-e2e-gce-cos-k8sstable3-default/1123621511530287106/test_sequences.json
         2  2019-05-06T16:17:00Z  gs://apisnoop/pr-logs/pull/227/apisnoop-process-audits/1125429329426124800/artifacts/ci-kubernetes-e2e-gce-cos-k8sstable3-default/1123621511530287106/test_tags.json
         2  2019-05-06T16:17:00Z  gs://apisnoop/pr-logs/pull/227/apisnoop-process-audits/1125429329426124800/artifacts/ci-kubernetes-e2e-gce-cos-k8sstable3-default/1123621511530287106/tests.json
     13560  2019-05-06T16:17:00Z  gs://apisnoop/pr-logs/pull/227/apisnoop-process-audits/1125429329426124800/artifacts/ci-kubernetes-e2e-gce-cos-k8sstable3-default/1123621511530287106/useragents.json

gs://apisnoop/pr-logs/pull/227/apisnoop-process-audits/1125429329426124800/artifacts/ci-kubernetes-e2e-gci-gce/:

gs://apisnoop/pr-logs/pull/227/apisnoop-process-audits/1125429329426124800/artifacts/ci-kubernetes-e2e-gci-gce/1123708008795213828/:
    302081  2019-05-06T16:17:00Z  gs://apisnoop/pr-logs/pull/227/apisnoop-process-audits/1125429329426124800/artifacts/ci-kubernetes-e2e-gci-gce/1123708008795213828/endpoints.json
       497  2019-05-06T16:17:00Z  gs://apisnoop/pr-logs/pull/227/apisnoop-process-audits/1125429329426124800/artifacts/ci-kubernetes-e2e-gci-gce/1123708008795213828/finished.json
       329  2019-05-06T16:17:00Z  gs://apisnoop/pr-logs/pull/227/apisnoop-process-audits/1125429329426124800/artifacts/ci-kubernetes-e2e-gci-gce/1123708008795213828/metadata.json
   9189805  2019-05-06T16:17:02Z  gs://apisnoop/pr-logs/pull/227/apisnoop-process-audits/1125429329426124800/artifacts/ci-kubernetes-e2e-gci-gce/1123708008795213828/test_sequences.json
    209227  2019-05-06T16:17:00Z  gs://apisnoop/pr-logs/pull/227/apisnoop-process-audits/1125429329426124800/artifacts/ci-kubernetes-e2e-gci-gce/1123708008795213828/test_tags.json
   2388979  2019-05-06T16:17:02Z  gs://apisnoop/pr-logs/pull/227/apisnoop-process-audits/1125429329426124800/artifacts/ci-kubernetes-e2e-gci-gce/1123708008795213828/tests.json
     33159  2019-05-06T16:17:00Z  gs://apisnoop/pr-logs/pull/227/apisnoop-process-audits/1125429329426124800/artifacts/ci-kubernetes-e2e-gci-gce/1123708008795213828/useragents.json
TOTAL: 40 objects, 58187888 bytes (55.49 MiB)
#+END_EXAMPLE

** merges/commits to master
[[file:~/ii/org/cncf/ci/prow.org::*apisnoop-postprocess-audits][apisnoop-postprocess-audits]]

In this commit, we ensured prow used the ./hack/ci/prow-{pr,production}.sh scripts:
https://github.com/ii/org/commit/37ca6efdae5a171057ea54a6636da7bfd12ac921#diff-d4230618edd14907315eae1f5dd6b95f

#+BEGIN_SRC shell
  gsutil ls gs://apisnoop/logs/apisnoop-postprocess-audits/
  LATEST_JOB=$(gsutil cat gs://apisnoop/logs/apisnoop-postprocess-audits/latest-build.txt)
  echo LATEST_JOB: $LATEST_JOB
  LATEST_BUCKET_PREFIX=$(echo gs://apisnoop/logs/apisnoop-postprocess-audits/$LATEST_JOB/)
  echo LATEST_BUCKET_PREFIX=$LATEST_BUCKET_PREFIX
  gsutil ls -lR $LATEST_BUCKET_PREFIX
#+END_SRC

#+RESULTS:
#+BEGIN_EXAMPLE :noeval t
gs://apisnoop/logs/apisnoop-postprocess-audits/latest-build.txt
gs://apisnoop/logs/apisnoop-postprocess-audits/1125244251995639808/
gs://apisnoop/logs/apisnoop-postprocess-audits/1125429203592810496/
gs://apisnoop/logs/apisnoop-postprocess-audits/1125429832742604800/
LATEST_JOB: 1125429832742604800
LATEST_BUCKET_PREFIX=gs://apisnoop/logs/apisnoop-postprocess-audits/1125429832742604800/
gs://apisnoop/logs/apisnoop-postprocess-audits/1125429832742604800/:
     42743  2019-05-06T16:18:46Z  gs://apisnoop/logs/apisnoop-postprocess-audits/1125429832742604800/build-log.txt
      1471  2019-05-06T16:00:28Z  gs://apisnoop/logs/apisnoop-postprocess-audits/1125429832742604800/clone-log.txt
      1908  2019-05-06T16:00:29Z  gs://apisnoop/logs/apisnoop-postprocess-audits/1125429832742604800/clone-records.json
       111  2019-05-06T16:18:46Z  gs://apisnoop/logs/apisnoop-postprocess-audits/1125429832742604800/finished.json
       158  2019-05-06T16:00:28Z  gs://apisnoop/logs/apisnoop-postprocess-audits/1125429832742604800/started.json

gs://apisnoop/logs/apisnoop-postprocess-audits/1125429832742604800/artifacts/:

gs://apisnoop/logs/apisnoop-postprocess-audits/1125429832742604800/artifacts/ci-kubernetes-e2e-gce-cos-k8sbeta-default/:

gs://apisnoop/logs/apisnoop-postprocess-audits/1125429832742604800/artifacts/ci-kubernetes-e2e-gce-cos-k8sbeta-default/1123720090269782017/:
    302087  2019-05-06T16:18:46Z  gs://apisnoop/logs/apisnoop-postprocess-audits/1125429832742604800/artifacts/ci-kubernetes-e2e-gce-cos-k8sbeta-default/1123720090269782017/endpoints.json
       489  2019-05-06T16:18:46Z  gs://apisnoop/logs/apisnoop-postprocess-audits/1125429832742604800/artifacts/ci-kubernetes-e2e-gce-cos-k8sbeta-default/1123720090269782017/finished.json
       325  2019-05-06T16:18:46Z  gs://apisnoop/logs/apisnoop-postprocess-audits/1125429832742604800/artifacts/ci-kubernetes-e2e-gce-cos-k8sbeta-default/1123720090269782017/metadata.json
   9516611  2019-05-06T16:18:48Z  gs://apisnoop/logs/apisnoop-postprocess-audits/1125429832742604800/artifacts/ci-kubernetes-e2e-gce-cos-k8sbeta-default/1123720090269782017/test_sequences.json
    200941  2019-05-06T16:18:46Z  gs://apisnoop/logs/apisnoop-postprocess-audits/1125429832742604800/artifacts/ci-kubernetes-e2e-gce-cos-k8sbeta-default/1123720090269782017/test_tags.json
   2530649  2019-05-06T16:18:48Z  gs://apisnoop/logs/apisnoop-postprocess-audits/1125429832742604800/artifacts/ci-kubernetes-e2e-gce-cos-k8sbeta-default/1123720090269782017/tests.json
     33061  2019-05-06T16:18:46Z  gs://apisnoop/logs/apisnoop-postprocess-audits/1125429832742604800/artifacts/ci-kubernetes-e2e-gce-cos-k8sbeta-default/1123720090269782017/useragents.json

gs://apisnoop/logs/apisnoop-postprocess-audits/1125429832742604800/artifacts/ci-kubernetes-e2e-gce-cos-k8sstable1-default/:

gs://apisnoop/logs/apisnoop-postprocess-audits/1125429832742604800/artifacts/ci-kubernetes-e2e-gce-cos-k8sstable1-default/1123713042312335360/:
    285713  2019-05-06T16:18:46Z  gs://apisnoop/logs/apisnoop-postprocess-audits/1125429832742604800/artifacts/ci-kubernetes-e2e-gce-cos-k8sstable1-default/1123713042312335360/endpoints.json
       493  2019-05-06T16:18:46Z  gs://apisnoop/logs/apisnoop-postprocess-audits/1125429832742604800/artifacts/ci-kubernetes-e2e-gce-cos-k8sstable1-default/1123713042312335360/finished.json
       329  2019-05-06T16:18:46Z  gs://apisnoop/logs/apisnoop-postprocess-audits/1125429832742604800/artifacts/ci-kubernetes-e2e-gce-cos-k8sstable1-default/1123713042312335360/metadata.json
  14106658  2019-05-06T16:18:48Z  gs://apisnoop/logs/apisnoop-postprocess-audits/1125429832742604800/artifacts/ci-kubernetes-e2e-gce-cos-k8sstable1-default/1123713042312335360/test_sequences.json
    182185  2019-05-06T16:18:46Z  gs://apisnoop/logs/apisnoop-postprocess-audits/1125429832742604800/artifacts/ci-kubernetes-e2e-gce-cos-k8sstable1-default/1123713042312335360/test_tags.json
   3016622  2019-05-06T16:18:48Z  gs://apisnoop/logs/apisnoop-postprocess-audits/1125429832742604800/artifacts/ci-kubernetes-e2e-gce-cos-k8sstable1-default/1123713042312335360/tests.json
     31477  2019-05-06T16:18:46Z  gs://apisnoop/logs/apisnoop-postprocess-audits/1125429832742604800/artifacts/ci-kubernetes-e2e-gce-cos-k8sstable1-default/1123713042312335360/useragents.json

gs://apisnoop/logs/apisnoop-postprocess-audits/1125429832742604800/artifacts/ci-kubernetes-e2e-gce-cos-k8sstable2-default/:

gs://apisnoop/logs/apisnoop-postprocess-audits/1125429832742604800/artifacts/ci-kubernetes-e2e-gce-cos-k8sstable2-default/1123638123377463296/:
    279017  2019-05-06T16:18:46Z  gs://apisnoop/logs/apisnoop-postprocess-audits/1125429832742604800/artifacts/ci-kubernetes-e2e-gce-cos-k8sstable2-default/1123638123377463296/endpoints.json
       493  2019-05-06T16:18:46Z  gs://apisnoop/logs/apisnoop-postprocess-audits/1125429832742604800/artifacts/ci-kubernetes-e2e-gce-cos-k8sstable2-default/1123638123377463296/finished.json
       329  2019-05-06T16:18:46Z  gs://apisnoop/logs/apisnoop-postprocess-audits/1125429832742604800/artifacts/ci-kubernetes-e2e-gce-cos-k8sstable2-default/1123638123377463296/metadata.json
  12371776  2019-05-06T16:18:48Z  gs://apisnoop/logs/apisnoop-postprocess-audits/1125429832742604800/artifacts/ci-kubernetes-e2e-gce-cos-k8sstable2-default/1123638123377463296/test_sequences.json
    149436  2019-05-06T16:18:46Z  gs://apisnoop/logs/apisnoop-postprocess-audits/1125429832742604800/artifacts/ci-kubernetes-e2e-gce-cos-k8sstable2-default/1123638123377463296/test_tags.json
   2639290  2019-05-06T16:18:48Z  gs://apisnoop/logs/apisnoop-postprocess-audits/1125429832742604800/artifacts/ci-kubernetes-e2e-gce-cos-k8sstable2-default/1123638123377463296/tests.json
     30021  2019-05-06T16:18:46Z  gs://apisnoop/logs/apisnoop-postprocess-audits/1125429832742604800/artifacts/ci-kubernetes-e2e-gce-cos-k8sstable2-default/1123638123377463296/useragents.json

gs://apisnoop/logs/apisnoop-postprocess-audits/1125429832742604800/artifacts/ci-kubernetes-e2e-gce-cos-k8sstable3-default/:

gs://apisnoop/logs/apisnoop-postprocess-audits/1125429832742604800/artifacts/ci-kubernetes-e2e-gce-cos-k8sstable3-default/1123621511530287106/:
    323678  2019-05-06T16:18:46Z  gs://apisnoop/logs/apisnoop-postprocess-audits/1125429832742604800/artifacts/ci-kubernetes-e2e-gce-cos-k8sstable3-default/1123621511530287106/endpoints.json
       497  2019-05-06T16:18:46Z  gs://apisnoop/logs/apisnoop-postprocess-audits/1125429832742604800/artifacts/ci-kubernetes-e2e-gce-cos-k8sstable3-default/1123621511530287106/finished.json
       331  2019-05-06T16:18:46Z  gs://apisnoop/logs/apisnoop-postprocess-audits/1125429832742604800/artifacts/ci-kubernetes-e2e-gce-cos-k8sstable3-default/1123621511530287106/metadata.json
         2  2019-05-06T16:18:46Z  gs://apisnoop/logs/apisnoop-postprocess-audits/1125429832742604800/artifacts/ci-kubernetes-e2e-gce-cos-k8sstable3-default/1123621511530287106/test_sequences.json
         2  2019-05-06T16:18:46Z  gs://apisnoop/logs/apisnoop-postprocess-audits/1125429832742604800/artifacts/ci-kubernetes-e2e-gce-cos-k8sstable3-default/1123621511530287106/test_tags.json
         2  2019-05-06T16:18:46Z  gs://apisnoop/logs/apisnoop-postprocess-audits/1125429832742604800/artifacts/ci-kubernetes-e2e-gce-cos-k8sstable3-default/1123621511530287106/tests.json
     13560  2019-05-06T16:18:46Z  gs://apisnoop/logs/apisnoop-postprocess-audits/1125429832742604800/artifacts/ci-kubernetes-e2e-gce-cos-k8sstable3-default/1123621511530287106/useragents.json

gs://apisnoop/logs/apisnoop-postprocess-audits/1125429832742604800/artifacts/ci-kubernetes-e2e-gci-gce/:

gs://apisnoop/logs/apisnoop-postprocess-audits/1125429832742604800/artifacts/ci-kubernetes-e2e-gci-gce/1123708008795213828/:
    302081  2019-05-06T16:18:46Z  gs://apisnoop/logs/apisnoop-postprocess-audits/1125429832742604800/artifacts/ci-kubernetes-e2e-gci-gce/1123708008795213828/endpoints.json
       497  2019-05-06T16:18:46Z  gs://apisnoop/logs/apisnoop-postprocess-audits/1125429832742604800/artifacts/ci-kubernetes-e2e-gci-gce/1123708008795213828/finished.json
       329  2019-05-06T16:18:46Z  gs://apisnoop/logs/apisnoop-postprocess-audits/1125429832742604800/artifacts/ci-kubernetes-e2e-gci-gce/1123708008795213828/metadata.json
   9189805  2019-05-06T16:18:48Z  gs://apisnoop/logs/apisnoop-postprocess-audits/1125429832742604800/artifacts/ci-kubernetes-e2e-gci-gce/1123708008795213828/test_sequences.json
    209227  2019-05-06T16:18:46Z  gs://apisnoop/logs/apisnoop-postprocess-audits/1125429832742604800/artifacts/ci-kubernetes-e2e-gci-gce/1123708008795213828/test_tags.json
   2388979  2019-05-06T16:18:48Z  gs://apisnoop/logs/apisnoop-postprocess-audits/1125429832742604800/artifacts/ci-kubernetes-e2e-gci-gce/1123708008795213828/tests.json
     33159  2019-05-06T16:18:46Z  gs://apisnoop/logs/apisnoop-postprocess-audits/1125429832742604800/artifacts/ci-kubernetes-e2e-gci-gce/1123708008795213828/useragents.json
TOTAL: 40 objects, 58186542 bytes (55.49 MiB)
#+END_EXAMPLE
* netlify.toml
:PROPERTIES:
:header-args:toml: :tangle ~/apisnoop/netlify.toml
:END:

[[file:~/apisnoop/netlify.toml]]
[[orgit:~/apisnoop/][~/apisnoop/ (magit-status)]]

Theses files are referenced:

[[file:~/apisnoop/hack/ci/netlify-production.sh][file:~/apisnoop/hack/ci/netlify-production.sh]]
[[file:~/apisnoop/hack/ci/netlify-pr.sh][file:~/apisnoop/hack/ci/netlify-pr.sh]]


#+BEGIN_SRC toml
  # https://www.netlify.com/docs/netlify-toml-reference/
  [build]
    # Directory to change to before starting a build.
    # This is where we will look for package.json/.nvmrc/etc.
    base = "./"

    # Directory (relative to root of your repo) that contains the deploy-ready
    # HTML files and assets generated by the build. If a base directory has
    # been specified, include it in the publish directory path.
    publish = "app/build/"

    # Default build command.
    # command = "echo NETLIFY.TOML && ./update.sh && cd app && npm install && npm run build"

    # Directory with the lambda functions to deploy to AWS.
    # functions = "project/functions/"
#+END_SRC

#+BEGIN_SRC toml
  # Production context: all deploys from the Production branch set in your site's
  # deploy contexts will inherit these settings.
  [context.production]
    command = "./hack/ci/netlify-production.sh"

  # Deploy Preview context: all deploys resulting from a pull/merge request will
  # inherit these settings.
  [context.deploy-preview]
    command = "./hack/ci/netlify-pr.sh"

  # Here is another way to define context specific environment variables.
  # [context.deploy-preview.environment]
  #   ACCESS_TOKEN = "not so secret"
#+END_SRC

#+BEGIN_SRC toml
  # Branch Deploy context: all deploys that are not from a pull/merge request or
  # from the Production branch will inherit these settings.
  # [context.branch-deploy]
  #   command = "./hack/ci-netlify-branch.sh"
  # [context.branch-deploy.environment]
  #   NODE_ENV = "development"
#+END_SRC

#+BEGIN_SRC toml
  [[redirects]]
    from = "https://apisnoop.io"
    to = "https://apisnoop.cncf.io"
    status = 200
    force = true
#+END_SRC

* env
** PR
   https://github.com/cncf/apisnoop/pull/219

*** Netlify Deploy Preview

From https://app.netlify.com/sites/apisnoop/deploys/5ccf982f52644d22f79238eb

#+BEGIN_EXAMPLE
HEAD=data-gen/explore.org
BRANCH=pull/219/head
CONTEXT=deploy-preview
DEPLOY_URL=https://5ccf982f52644d22f79238eb--apisnoop.netlify.com
DEPLOY_PRIME_URL=https://deploy-preview-219--apisnoop.netlify.com
URL=https://apisnoop.io
#+END_EXAMPLE

*** Prow Presubmit Job

From http://prow.cncf.ci/view/gcs/apisnoop/pr-logs/pull/219/apisnoop-process-audits/1125220549417504768

** master commits/merges
*** Netlify Production Branch Deploy
From https://app.netlify.com/sites/apisnoop/deploys/5ccf991d207453000860155ba

#+BEGIN_SRC
HEAD=master
BRANCH=master
CONTEXT=production
DEPLOY_URL=https://5ccf991d207453000860155b--apisnoop.netlify.com
DEPLOY_PRIME_URL=https://master--apisnoop.netlify.com
URL=https://apisnoop.io
#+END_SRC

* Footnotes
  :PROPERTIES:
  :header-args:shell+: :dir ~/apisnoop
  :VISIBILITY: folded
  :END:

#+PROPERTY: header-args:shell :results output code verbatim replace
#+PROPERTY: header-args:shell+ :exports both
#+PROPERTY: header-args:shell+ :wrap "EXAMPLE :noeval t"
#+PROPERTY: header-args:shell+ :eval no-export
#+PROPERTY: header-args:shell+ :noweb-ref (nth 4 (org-heading-components))
#+PROPERTY: header-args:tmate  :socket (symbol-value 'socket)
#+PROPERTY: header-args:tmate+ :session (concat (user-login-name) ":" (nth 4 (org-heading-components)))
#+PROPERTY: header-args:tmate+ :noweb yes
#+PROPERTY: header-args:json  :noweb yes
#+PROPERTY: header-args:json+ :noweb-ref (nth 4 (org-heading-components))
#+PROPERTY: header-args:yaml  :noweb yes
#+PROPERTY: header-args:yaml+ :comments org
#+PROPERTY: header-args:yaml+ :noweb-ref (nth 4 (org-heading-components))
#+REVEAL_ROOT: http://cdn.jsdelivr.net/reveal.js/3.0.0/
#+STARTUP: content
# Local Variables:
# eval: (set (make-local-variable 'org-file-dir) (file-name-directory buffer-file-name))
# eval: (set (make-local-variable 'user-buffer) (concat user-login-name "." (file-name-base buffer-file-name)))
# eval: (set (make-local-variable 'tmpdir) (make-temp-file (concat "/dev/shm/" user-buffer "-") t))
# eval: (set (make-local-variable 'socket) (concat "/tmp/" user-buffer ".iisocket"))
# eval: (set (make-local-variable 'select-enable-clipboard) t)
# eval: (set (make-local-variable 'select-enable-primary) t)
# eval: (set (make-local-variable 'start-tmate-command) (concat "tmate -S " socket " new-session -A -s " user-login-name " -n main \"tmate wait tmate-ready && tmate display -p '#{tmate_ssh}' | xclip -i -sel p -f | xclip -i -sel c; bash --login\""))
# eval: (xclip-mode 1)
# eval: (gui-select-text start-tmate-command)
# eval: (xclip-mode 0)
# org-babel-tmate-session-prefix: ""
# org-babel-tmate-default-window-name: "main"
# org-confirm-babel-evaluate: nil
# org-use-property-inheritance: t
# End:
